content/GNU-sed.org
#+title: GNU Sed
#+author: Kyeong Soo Choi
#+property: header-args :shell :tangle no :results output


* Introduction

The command name =sed= is derived from stream editor. Here, stream
refers to data being passed via shell pipes. Thus, the command's
primary functionality is to act as a text editor for stdin data with
stdout as the output target. Over the years, functionality was added
to edit file input and save the changes back to the same file.

=s= stands for substitute command
=/= is an idiomatic delimiter character to separate various portions of
the command
=REGEXP= stands for regular expression
=REPLACEMENT= specifies the replacement string
=FLAGS= are options to change default behavior of the command

** Basic Usage

#+begin_src shell
  printf '1,2,3,4\na,b,c,d\n' | sed 's/,/-/g'
#+end_src

#+RESULTS:
| 1-2-3-4 |
| a-b-c-d |

* In-place file editing

** With backup

When an extension is provided as an argument to -i option, the
original contents of the input file gets preserved as per the
extension given. For example, if the input file is =ip.txt= and
=-i.orig= is used, the backup file will be named as =ip.txt.orig=


#+begin_src shell :results none
  sed -i.bkp 's/blue/green/' examples/sed/colors.txt
#+end_src

** Without backup

Sometimes backups are not desirable. Using -i option on its own will
prevent creating backups. Be careful though, as changes made connot be
undone. In such cases, tets the command with sample input before using
-i option on actual file. You could also use the option with backup,
compare the differences with a =diff= program and then delete the backup.

#+begin_src shell :results none
  sed -i 's/an/AN/g' examples/sed/fruits.txt
#+end_src

** Multiple files

Multiple input files are treated individually and the changes are
written back to repective files.

#+begin_src shell :results none
  sed -i.bkp 's/bad/good/' examples/sed/f1.txt examples/sed/f2.txt
#+end_src

Using wildcard and globbing

#+begin_src shell
  sed -i.bkp 's/bad/good/' examples/sed/f?.*
#+end_src

** Prefix backup name

A * character in the argumetn to -i option is special. It will get
replaced with the input filename. This is helpful if you need to use a
prefix instead of suffix for the backup filename. Or any other
combination that may be needed.

#+begin_src shell :results none
  sed -i'bkp.*' 's/green/yellow/' examples/sed/colors.txt
#+end_src

** Place backups in different directory

The =*= trick can also be used to place the backups in another directory
instead of the parent directory of input files. The backup directory
should already exist for this to work.

#+begin_src shell :results none
  sed -i'backups/*' 's/good/nice' examples/sed/f?.*
#+end_src

** Cheatsheet and summary

| Note          | Description                                                                                                                      |
| -i            | after processing, write back changes to the source file(s) changes made cannot be undone, so use this option with caution        |
| -i.bkp        | in addition to in-place eiditing, preserve original contents to a whose name is derived from input filename and .bkp as a suffix |
| -i'bkp.*'     | * here gets replaced with input filename thus providing a way to add a prefix instead of a suffix                                |
| -i'backups/*' | this will place the backup copy in a different existing directory instead of source directory                                    |

* Selective editing

By default, sed acts on the entire input content. Many a times, you
only want to act upon specific portions of the input. To that end, sed
has features to filter lines, similar to tools like grep, head and
tail. sed can replicate most of grep's filtering features without too
much fuss. And has features like line number based filtering,
selecting lines between two patterns, relative addressing, etc which
isn't possible with grep. If you are familiar with functional
programming, you would have come across map, filter, reduce paradigm.
A typical task with sed involves filtering a subset of input and then
modifying (mapping) them. Sometimes, the subset is the entire input,
as seen in the examples of previous chapters.

** Conditional execution

As seen earlier, the syntax for substitute command is
s/REGEXP/REPLACEMENT/FLAGS. The /REGEXP/FLAGS portion can be used as a
conditional expression to allow commands to execute only for the lines
matching the pattern.

#+begin_src shell
  printf '1,2,3,4\na,b,c,d\n' | sed '/2/ s/,/-/g'
#+end_src

#+RESULTS:
: 1-2-3-4
: a,b,c,d

Use /REGEXP/FLAGS! to act upon lines other than the matching ones.

#+begin_src shell
  printf '1,2,3,4\na,b,c,d\n' | sed '/2/! s/,/-/g'
#+end_src

#+RESULTS:
: 1,2,3,4
: a-b-c-d

** Delete command

To delete the filtered lines, use the =d= command. Recall that all input
lines are printed by default.

#+begin_src shell
  printf 'sea\neat\ndrop\n' | sed '/at/d'
#+end_src

#+RESULTS:
: sea
: drop

#+begin_src shell
  # same as: grep -v 'at'
  printf 'sea\neat\ndrop\n' | sed '/at/!d'
#+end_src

#+RESULTS:
: eat

