GNU-sed.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GNU Sed</title>
<meta name="author" content="Kyeong Soo Choi" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">GNU Sed</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org877076c">1. Introduction</a>
<ul>
<li><a href="#org9bd335c">1.1. Basic Usage</a></li>
</ul>
</li>
<li><a href="#orgfb64799">2. In-place file editing</a>
<ul>
<li><a href="#org2e64147">2.1. With backup</a></li>
<li><a href="#orgd5fe9e6">2.2. Without backup</a></li>
<li><a href="#org581fbc8">2.3. Multiple files</a></li>
<li><a href="#org2831c6a">2.4. Prefix backup name</a></li>
<li><a href="#org82858fb">2.5. Place backups in different directory</a></li>
<li><a href="#orga168183">2.6. Cheatsheet and summary</a></li>
</ul>
</li>
<li><a href="#org074bd8c">3. Selective eiditing</a>
<ul>
<li><a href="#orgdae03df">3.1. Conditional execution</a></li>
<li><a href="#orgea25b21">3.2. Delete command</a></li>
<li><a href="#org4719d41">3.3. Print command</a></li>
<li><a href="#org5f637d7">3.4. Quit commands</a></li>
<li><a href="#org713ba72">3.5. Line addressing</a></li>
<li><a href="#org7d84ae9">3.6. Print only line number</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org877076c" class="outline-2">
<h2 id="org877076c"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The command name <code>sed</code> is derived from stream editor. Here, stream
refers to data being passed via shell pipes. Thus, the command's
primary functionality is to act as a text editor for stdin data with
stdout as the output target. Over the years, functionality was added
to edit file input and save the changes back to the same file.
</p>

<p>
<code>s</code> stands for substitute command
<code>/</code> is an idiomatic delimiter character to separate various portions of
the command
<code>REGEXP</code> stands for regular expression
<code>REPLACEMENT</code> specifies the replacement string
<code>FLAGS</code> are options to change default behavior of the command
</p>
</div>

<div id="outline-container-org9bd335c" class="outline-3">
<h3 id="org9bd335c"><span class="section-number-3">1.1.</span> Basic Usage</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-shell">printf <span style="font-style: italic;">'1,2,3,4\na,b,c,d\n'</span> | sed <span style="font-style: italic;">'s/,/-/g'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfb64799" class="outline-2">
<h2 id="orgfb64799"><span class="section-number-2">2.</span> In-place file editing</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2e64147" class="outline-3">
<h3 id="org2e64147"><span class="section-number-3">2.1.</span> With backup</h3>
<div class="outline-text-3" id="text-2-1">
<p>
When an extension is provided as an argument to -i option, the
original contents of the input file gets preserved as per the
extension given. For example, if the input file is <code>ip.txt</code> and
<code>-i.orig</code> is used, the backup file will be named as <code>ip.txt.orig</code>
</p>


<div class="org-src-container">
<pre class="src src-shell">sed -i.bkp <span style="font-style: italic;">'s/blue/green/'</span> examples/sed/colors.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5fe9e6" class="outline-3">
<h3 id="orgd5fe9e6"><span class="section-number-3">2.2.</span> Without backup</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Sometimes backups are not desirable. Using -i option on its own will
prevent creating backups. Be careful though, as changes made connot be
undone. In such cases, tets the command with sample input before using
-i option on actual file. You could also use the option with backup,
compare the differences with a <code>diff</code> program and then delete the backup.
</p>

<div class="org-src-container">
<pre class="src src-shell">sed -i <span style="font-style: italic;">'s/an/AN/g'</span> examples/sed/fruits.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org581fbc8" class="outline-3">
<h3 id="org581fbc8"><span class="section-number-3">2.3.</span> Multiple files</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Multiple input files are treated individually and the changes are
written back to repective files.
</p>

<div class="org-src-container">
<pre class="src src-shell">sed -i.bkp <span style="font-style: italic;">'s/bad/good/'</span> examples/sed/f1.txt examples/sed/f2.txt
</pre>
</div>

<p>
Using wildcard and globbing
</p>

<div class="org-src-container">
<pre class="src src-shell">sed -i.bkp <span style="font-style: italic;">'s/bad/good/'</span> examples/sed/f?.*
</pre>
</div>
</div>
</div>

<div id="outline-container-org2831c6a" class="outline-3">
<h3 id="org2831c6a"><span class="section-number-3">2.4.</span> Prefix backup name</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A * character in the argumetn to -i option is special. It will get
replaced with the input filename. This is helpful if you need to use a
prefix instead of suffix for the backup filename. Or any other
combination that may be needed.
</p>

<div class="org-src-container">
<pre class="src src-shell">sed -i<span style="font-style: italic;">'bkp.*'</span> <span style="font-style: italic;">'s/green/yellow/'</span> examples/sed/colors.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org82858fb" class="outline-3">
<h3 id="org82858fb"><span class="section-number-3">2.5.</span> Place backups in different directory</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The <code>*</code> trick can also be used to place the backups in another directory
instead of the parent directory of input files. The backup directory
should already exist for this to work.
</p>

<div class="org-src-container">
<pre class="src src-shell">sed -i<span style="font-style: italic;">'backups/*'</span> <span style="font-style: italic;">'s/good/nice'</span> examples/sed/f?.*
</pre>
</div>
</div>
</div>

<div id="outline-container-orga168183" class="outline-3">
<h3 id="orga168183"><span class="section-number-3">2.6.</span> Cheatsheet and summary</h3>
<div class="outline-text-3" id="text-2-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Note</td>
<td class="org-left">Description</td>
</tr>

<tr>
<td class="org-left">-i</td>
<td class="org-left">after processing, write back changes to the source file(s) changes made cannot be undone, so use this option with caution</td>
</tr>

<tr>
<td class="org-left">-i.bkp</td>
<td class="org-left">in addition to in-place eiditing, preserve original contents to a whose name is derived from input filename and .bkp as a suffix</td>
</tr>

<tr>
<td class="org-left">-i'bkp.*'</td>
<td class="org-left">* here gets replaced with input filename thus providing a way to add a prefix instead of a suffix</td>
</tr>

<tr>
<td class="org-left">-i'backups/*'</td>
<td class="org-left">this will place the backup copy in a different existing directory instead of source directory</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org074bd8c" class="outline-2">
<h2 id="org074bd8c"><span class="section-number-2">3.</span> Selective eiditing</h2>
<div class="outline-text-2" id="text-3">
<p>
By default, sed acts on the entire input content. Many a times, you
only want to act upon specific portions of the input. To that end, sed
has features to filter lines, similar to tools like grep, head and
tail. sed can replicate most of grep's filtering features without too
much fuss. And has features like line number based filtering,
selecting lines between two patterns, relative addressing, etc which
isn't possible with grep. If you are familiar with functional
programming, you would have come across map, filter, reduce paradigm.
A typical task with sed involves filtering a subset of input and then
modifying (mapping) them. Sometimes, the subset is the entire input,
as seen in the examples of previous chapters.
</p>
</div>

<div id="outline-container-orgdae03df" class="outline-3">
<h3 id="orgdae03df"><span class="section-number-3">3.1.</span> Conditional execution</h3>
<div class="outline-text-3" id="text-3-1">
<p>
As seen earlier, the syntax for substitute command is
s/REGEXP/REPLACEMENT/FLAGS. The /REGEXP/FLAGS portion can be used as a
conditional expression to allow commands to execute only for the lines
matching the pattern.
</p>

<div class="org-src-container">
<pre class="src src-shell">printf <span style="font-style: italic;">'1,2,3,4\na,b,c,d\n'</span> | sed <span style="font-style: italic;">'/2/ s/,/-/g'</span>
</pre>
</div>

<p>
Use /REGEXP/FLAGS! to act upon lines other than the matching ones.
</p>

<div class="org-src-container">
<pre class="src src-shell">printf <span style="font-style: italic;">'1,2,3,4\na,b,c,d\n'</span> | sed <span style="font-style: italic;">'/2/! s/,/-/g'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea25b21" class="outline-3">
<h3 id="orgea25b21"><span class="section-number-3">3.2.</span> Delete command</h3>
<div class="outline-text-3" id="text-3-2">
<p>
To delete the filtered lines, use the <code>d</code> command. Recall that all input
lines are printed by default.
</p>

<div class="org-src-container">
<pre class="src src-shell">printf <span style="font-style: italic;">'sea\neat\ndrop\n'</span> | sed <span style="font-style: italic;">'/at/d'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as: grep -v 'at'</span>
printf <span style="font-style: italic;">'sea\neat\ndrop\n'</span> | sed <span style="font-style: italic;">'/at/!d'</span>
</pre>
</div>
</div>
</div>
