content/GNU-sed.org
** Print command

To print the filtered lines, use the =p= command. But, recall that all
input lines are printed by default. So, this command is typically used
in combination with -n command line option, which would turn off the
default printing.

#+begin_src shell
  # same as: grep 'twice' examples/sed/programming_quotes.txt
  sed -n '/twice/p' examples/sed/programming_quotes.txt

  # same as: grep 'e th' examples/sed/programming_quotes.txt
  sed -n '/e th/p' examples/sed/programming_quotes.txt
#+end_src

The substitue command provides =p= as a flag. In such a case, the
modified line would be printed only if the substituion succeeded.

#+begin_src shell
  # same as grep '1' programming_quotes.txt | sed 's/1/one/g'
  sed -n 's/1/one/gp' examples/sed/programming_quotes.txt

  # filter + substitution + p combination
  # same as grep 'not' programming_qoutes.txt | sed 's/in/**/g'
  sed -n '/not/ s/in/**/gp' examples/sed/programming_quotes.txt
#+end_src

#+RESULTS:
: naming things, and off-by-one errors by Leon Bambrick
: by def**ition, not smart enough to debug it by Brian W. Kernighan
: A language that does not affect the way you th**k about programm**g,
: is not worth know**g by Alan Perlis

Using !p with -n option will be equivalent to using d command.

#+begin_src shell
  # same as: sed '/at/d'
  printf 'sea\neat\ndrop\n' | sed -n '/at/!p'
#+end_src

#+RESULTS:
: sea
: drop

** Quit commands

Using q command wil exit sed immediately, without any further
processing.

#+begin_src shell
  # quits after an input line containing 'if' is found
  sed '/if/q' examples/sed/programming_quotes.txt 
#+end_src

#+RESULTS:
: Debugging is twice as hard as writing the code in the first place.
: Therefore, if you write the code as cleverly as possible, you are,

Q command is similar to q but won't print the matching line.

#+begin_src shell
  sed '/if/Q' examples/sed/programming_quotes.txt 
#+end_src

#+RESULTS:
: Debugging is twice as hard as writing the code in the first place.

Use =tac= to get all lines starting from last occurrence of the search
string with respect to entire file content.

#+begin_src shell
  tac examples/sed/programming_quotes.txt | sed '/not/q' | tac
#+end_src

#+RESULTS:
: is not worth knowing by Alan Perlis
: 
: There are 2 hard problems in computer science: cache invalidation,
: naming things, and off-by-1 errors by Leon Bambrick

You can optionally provides an exit status (from 0 to 255) along with
the quit commands.

#+begin_src shell :results value
  printf 'sea\neat\ndrop\n' | sed '/at/q2'
#+end_src

#+RESULTS:
: 2


** COMMENT Multiple commands

Commands seen so far can be specified more than once by separating
them using =;= or using the =-e= command line option.

#+begin_src shell
  printf 'sea\neat\ndrop\n' | sed -n -e 'p' -e 's/at/AT/p'
  echo '--------------------'
  printf 'sea\neat\ndrop\n' | sed -n 'p; s/at/AT/p'
#+end_src

#+RESULTS:
: sea
: eat
: eAT
: drop
: --------------------
: sea
: eat
: eAT
: drop

Another way is to separate the commands using a literal newline
character. If more than 2-3 lines are needed, it is better to use a
sed script instead.

#+begin_src shell
  sed -n '
  /not/ s/in/**/gp
  s/1/one/gp
  s/2/two/gp
  ' examples/sed/programming_quotes.txt
#+end_src

#+RESULTS:
: by def**ition, not smart enough to debug it by Brian W. Kernighan
: A language that does not affect the way you th**k about programm**g,
: is not worth know**g by Alan Perlis
: There are two hard problems in computer science: cache invalidation,
: naming things, and off-by-one errors by Leon Bambrick

#+begin_src shell
  sed -n -f examples/sed/script.sed examples/sed/programming_quotes.txt 
#+end_src

#+RESULTS:
: by def**ition, not smart enough to debug it by Brian W. Kernighan
: A language that does not affect the way you th**k about programm**g,
: is not worth know**g by Alan Perlis
: There are two hard problems in computer science: cache invalidation,
: naming things, and off-by-one errors by Leon Bambrick

To execute multiple commands for a common filter, use {} to group the
commands. You can also nest them if needed.

#+begin_src shell
  # same as: sed -n 'p; s/at/AT/p'
  printf 'sea\neat\ndrop\n' | sed '/at/{p; s/at/AT/}'
  echo '--------------'
  # spaces around {} is optional
  printf 'gates\nnot\nused\n' | sed '/e/{s/s/*/g; s/t/*/g}'
#+end_src

#+RESULTS:
: sea
: eat
: eAT
: drop
: --------------
: ga*e*
: not
: u*ed

Command grouping is an easy way to construct conditional AND of
multiple search strings.

#+begin_src shell
  # same as: grep 'in' programming_qoutes.txt | grep 'not'
  sed -n '/in/{/not/p}' examples/sed/programming_quotes.txt
  echo '--------------------'
  # same as: grep 'in' programming_quotes.txt | grep 'not' | grep 'you'
  sed -n '/in/{/not/{/you/p}}' examples/sed/programming_quotes.txt
  echo '--------------------'
  # same as: grep 'not' programming_quotes.txt | grep -v 'you'
  sed -n '/not/{/you/!p}' examples/sed/programming_quotes.txt 
#+end_src

#+RESULTS:
: by definition, not smart enough to debug it by Brian W. Kernighan
: A language that does not affect the way you think about programming,
: is not worth knowing by Alan Perlis
: --------------------
: A language that does not affect the way you think about programming,
: --------------------
: by definition, not smart enough to debug it by Brian W. Kernighan
: is not worth knowing by Alan Perlis

** Line addressing

Line numbers can also be used as a filtering criteria.

#+begin_src shell
  # here, 3 represents the address for the print command
  # same as: head -n3 programming_quotes.txt | tail -n1 and sed '3!d'
  sed -n '3p' examples/sed/programming_quotes.txt
  echo '--------------------'
  # print 2nd and 5th line
  sed -n '2p; 5p' examples/sed/programming_quotes.txt
  echo '--------------------'
  # substitution only on 2nd line
  printf 'gates\nnot\nused\n' | sed '2 s/t/*/g'
#+end_src

#+RESULTS:
: by definition, not smart enough to debug it by Brian W. Kernighan
: --------------------
: Therefore, if you write the code as cleverly as possible, you are,
: Some people, when confronted with a problem, think - I know, I will
: --------------------
: gates
: no*
: used

As a special case, $ indicates the last line of the input

#+begin_src shell
  # same as: tail -n1 programming_quotes.txt
  sed -n '$p' examples/sed/programming_quotes.txt
#+end_src

#+RESULTS:
: naming things, and off-by-1 errors by Leon Bambrick

For large input files, use =q= command to avoid processing unnecessary
input lines.

#+begin_src shell
  seq 3542 4623452 | sed -n '2452{p; q}'
  echo '--------------------'
  seq 3542 4623452 | sed -n '250p; 2452{p; q}'
  echo '--------------------'
  # here is a sample time comparison
  time seq 3542 4623452 | sed -n '2452{p; q}' > examples/sed/f1
  echo '--------------------'
  time seq 3542 4623452 | sed -n '2452p' > examples/sed/f2
#+end_src

#+RESULTS:
: 5993
: --------------------
: 3791
: 5993
: --------------------
: --------------------

Mimicking =head= command using line addressing and the =q= command.

#+begin_src shell
  # same as: seq 23 45 | head -n5
  seq 23 45 | sed '5q'
#+end_src

#+RESULTS:
: 23
: 24
: 25
: 26
: 27

