GNU-sed.html

<div id="outline-container-org4719d41" class="outline-3">
<h3 id="org4719d41"><span class="section-number-3">3.3.</span> Print command</h3>
<div class="outline-text-3" id="text-3-3">
<p>
To print the filtered lines, use the <code>p</code> command. But, recall that all
input lines are printed by default. So, this command is typically used
in combination with -n command line option, which would turn off the
default printing.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as: grep 'twice' examples/sed/programming_quotes.txt</span>
sed -n <span style="font-style: italic;">'/twice/p'</span> examples/sed/programming_quotes.txt

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as: grep 'e th' examples/sed/programming_quotes.txt</span>
sed -n <span style="font-style: italic;">'/e th/p'</span> examples/sed/programming_quotes.txt
</pre>
</div>

<p>
The substitue command provides <code>p</code> as a flag. In such a case, the
modified line would be printed only if the substituion succeeded.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as grep '1' programming_quotes.txt | sed 's/1/one/g'</span>
sed -n <span style="font-style: italic;">'s/1/one/gp'</span> examples/sed/programming_quotes.txt

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">filter + substitution + p combination</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as grep 'not' programming_qoutes.txt | sed 's/in/**/g'</span>
sed -n <span style="font-style: italic;">'/not/ s/in/**/gp'</span> examples/sed/programming_quotes.txt
</pre>
</div>

<p>
Using !p with -n option will be equivalent to using d command.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as: sed '/at/d'</span>
printf <span style="font-style: italic;">'sea\neat\ndrop\n'</span> | sed -n <span style="font-style: italic;">'/at/!p'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f637d7" class="outline-3">
<h3 id="org5f637d7"><span class="section-number-3">3.4.</span> Quit commands</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Using q command wil exit sed immediately, without any further
processing.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">quits after an input line containing 'if' is found</span>
sed <span style="font-style: italic;">'/if/q'</span> examples/sed/programming_quotes.txt 
</pre>
</div>

<p>
Q command is similar to q but won't print the matching line.
</p>

<div class="org-src-container">
<pre class="src src-shell">sed <span style="font-style: italic;">'/if/Q'</span> examples/sed/programming_quotes.txt 
</pre>
</div>

<p>
Use <code>tac</code> to get all lines starting from last occurrence of the search
string with respect to entire file content.
</p>

<div class="org-src-container">
<pre class="src src-shell">tac examples/sed/programming_quotes.txt | sed <span style="font-style: italic;">'/not/q'</span> | tac
</pre>
</div>

<p>
You can optionally provides an exit status (from 0 to 255) along with
the quit commands.
</p>

<div class="org-src-container">
<pre class="src src-shell">printf <span style="font-style: italic;">'sea\neat\ndrop\n'</span> | sed <span style="font-style: italic;">'/at/q2'</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org713ba72" class="outline-3">
<h3 id="org713ba72"><span class="section-number-3">3.5.</span> Line addressing</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Line numbers can also be used as a filtering criteria.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">here, 3 represents the address for the print command</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as: head -n3 programming_quotes.txt | tail -n1 and sed '3!d'</span>
sed -n <span style="font-style: italic;">'3p'</span> examples/sed/programming_quotes.txt
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'--------------------'</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">print 2nd and 5th line</span>
sed -n <span style="font-style: italic;">'2p; 5p'</span> examples/sed/programming_quotes.txt
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'--------------------'</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">substitution only on 2nd line</span>
printf <span style="font-style: italic;">'gates\nnot\nused\n'</span> | sed <span style="font-style: italic;">'2 s/t/*/g'</span>
</pre>
</div>

<p>
As a special case, $ indicates the last line of the input
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as: tail -n1 programming_quotes.txt</span>
sed -n <span style="font-style: italic;">'$p'</span> examples/sed/programming_quotes.txt
</pre>
</div>

<p>
For large input files, use <code>q</code> command to avoid processing unnecessary
input lines.
</p>

<div class="org-src-container">
<pre class="src src-shell">seq 3542 4623452 | sed -n <span style="font-style: italic;">'2452{p; q}'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'--------------------'</span>
seq 3542 4623452 | sed -n <span style="font-style: italic;">'250p; 2452{p; q}'</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'--------------------'</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">here is a sample time comparison</span>
time seq 3542 4623452 | sed -n <span style="font-style: italic;">'2452{p; q}'</span> &gt; examples/sed/f1
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'--------------------'</span>
time seq 3542 4623452 | sed -n <span style="font-style: italic;">'2452p'</span> &gt; examples/sed/f2
</pre>
</div>

<p>
Mimicking <code>head</code> command using line addressing and the <code>q</code> command.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">same as: seq 23 45 | head -n5</span>
seq 23 45 | sed <span style="font-style: italic;">'5q'</span>
</pre>
</div>
</div>
</div>
