content/GNU-sed.org
** Print only line number

The = command will display the line numbers of matching lines.

#+begin_src shell
  # gives both line number and matching line
  grep -n 'not' examples/sed/programming_quotes.txt

  # gives only line number of matching line
  sed -n '/not/=' examples/sed/programming_quotes.txt 
#+end_src

#+RESULTS:
: 3:by definition, not smart enough to debug it by Brian W. Kernighan
: 8:A language that does not affect the way you think about programming,
: 9:is not worth knowing by Alan Perlis
: 3
: 8
: 9

If needed, matching line can also be printed. But there will be a
newline character between the matching line and line number.

#+begin_src shell
  sed -n '/off/{=; p}' examples/sed/programming_quotes.txt
  echo '--------------------'
  sed -n '/off/{p; =}' examples/sed/programming_quotes.txt 
#+end_src

#+RESULTS:
: 12
: naming things, and off-by-1 errors by Leon Bambrick
: --------------------
: naming things, and off-by-1 errors by Leon Bambrick
: 12

# Local Variables:
# org-confirm-babel-evaluate: nil
# End:
