GNU-sed.html

<div id="outline-container-org7d84ae9" class="outline-3">
<h3 id="org7d84ae9"><span class="section-number-3">3.6.</span> Print only line number</h3>
<div class="outline-text-3" id="text-3-6">
<p>
The = command will display the line numbers of matching lines.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">gives both line number and matching line</span>
grep -n <span style="font-style: italic;">'not'</span> examples/sed/programming_quotes.txt

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">gives only line number of matching line</span>
sed -n <span style="font-style: italic;">'/not/='</span> examples/sed/programming_quotes.txt 
</pre>
</div>

<p>
If needed, matching line can also be printed. But there will be a
newline character between the matching line and line number.
</p>

<div class="org-src-container">
<pre class="src src-shell">sed -n <span style="font-style: italic;">'/off/{=; p}'</span> examples/sed/programming_quotes.txt
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'--------------------'</span>
sed -n <span style="font-style: italic;">'/off/{p; =}'</span> examples/sed/programming_quotes.txt 
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kyeong Soo Choi</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
